## Northwind traders data analysis
Northwind Traders, an international gourmet food distributor.

## Objectives:

1. Evaluating employee performance to boost productivity

1. Understanding product sales and category performance to optimize inventory and marketing strategies

1. Analyzing sales growth to identify trends, monitor company progress, and make more accurate forecasts

1. Evaluating customer purchase behavior to target high-value customers with promotional incentives

In [1]:
%load_ext sql
%sql postgresql://postgres:dbpower24@localhost:5432/northwind

In [2]:
%%sql

SELECT table_name AS name,
       table_type AS type
  FROM information_schema.tables
 WHERE table_schema = 'public' AND table_type IN ('BASE TABLE', 'VIEW');

                      name        type
0              territories  BASE TABLE
1            order_details  BASE TABLE
2     employee_territories  BASE TABLE
3                us_states  BASE TABLE
4                customers  BASE TABLE
5                   orders  BASE TABLE
6                employees  BASE TABLE
7                 shippers  BASE TABLE
8                 products  BASE TABLE
9               categories  BASE TABLE
10               suppliers  BASE TABLE
11                  region  BASE TABLE
12   customer_demographics  BASE TABLE
13  customer_customer_demo  BASE TABLE

Make a query that looks at customers' company and contact details and order dates

In [11]:
%%sql
SELECT
    o.order_id,
    c.company_name,
    c.contact_name,
    o.order_date
FROM orders o
JOIN customers c ON o.customer_id = c.customer_id

     order_id                company_name         contact_name  order_date
0       10248   Vins et alcools Chevalier         Paul Henriot  1996-07-04
1       10249          Toms Spezialitäten        Karin Josephs  1996-07-05
2       10250               Hanari Carnes         Mario Pontes  1996-07-08
3       10251        Victuailles en stock         Mary Saveley  1996-07-08
4       10252            Suprêmes délices     Pascale Cartrain  1996-07-09
..        ...                         ...                  ...         ...
825     11073   Pericles Comidas clásicas  Guillermo Fernández  1998-05-05
826     11074               Simons bistro       Jytte Petersen  1998-05-06
827     11075          Richter Supermarkt         Michael Holz  1998-05-06
828     11076                    Bon app'     Laurence Lebihan  1998-05-06
829     11077  Rattlesnake Canyon Grocery         Paula Wilson  1998-05-06

[830 rows x 4 columns]

Make a query to look at what an order contains

In [12]:
%%sql
SELECT
    o.order_id,
    p.product_name,
    od.quantity,
    o.order_date
FROM order_details od
JOIN products p ON od.product_id = p.product_id
JOIN orders o ON od.order_id = o.order_id

      order_id                     product_name  quantity  order_date
0        10248                   Queso Cabrales        12  1996-07-04
1        10248    Singaporean Hokkien Fried Mee        10  1996-07-04
2        10248           Mozzarella di Giovanni         5  1996-07-04
3        10249                             Tofu         9  1996-07-05
4        10249            Manjimup Dried Apples        40  1996-07-05
...        ...                              ...       ...         ...
2150     11077        Wimmers gute Semmelknödel         2  1998-05-06
2151     11077        Louisiana Hot Spiced Okra         1  1998-05-06
2152     11077                       Röd Kaviar         2  1998-05-06
2153     11077             Rhönbräu Klosterbier         4  1998-05-06
2154     11077  Original Frankfurter grüne Soße         2  1998-05-06

[2155 rows x 4 columns]

Make a query to see which employees are responsible for the orders & sales

In [10]:
%%sql
SELECT 
    e.first_name || ' ' || e.last_name as employee_name,
    o.order_id,
    o.order_date
FROM orders o
JOIN employees e ON o.employee_id = e.employee_id

        employee_name  order_id  order_date
0     Steven Buchanan     10248  1996-07-04
1      Michael Suyama     10249  1996-07-05
2    Margaret Peacock     10250  1996-07-08
3     Janet Leverling     10251  1996-07-08
4    Margaret Peacock     10252  1996-07-09
..                ...       ...         ...
825     Andrew Fuller     11073  1998-05-05
826       Robert King     11074  1998-05-06
827    Laura Callahan     11075  1998-05-06
828  Margaret Peacock     11076  1998-05-06
829     Nancy Davolio     11077  1998-05-06

[830 rows x 3 columns]

## Employee ranking objectives

- First, the management team wants to recognize and reward top-performing employees, fostering a culture of excellence within the organization.

- Second, they want to identify employees who might be struggling so that they can offer the necessary training or resources to help them improve.

### Approach
We want to rank employees by total value of sales

In [8]:
%%sql
WITH EmployeeSales AS (
    SELECT e.employee_id, e.first_name ||' '|| e.last_name as employee_name,
           SUM((od.unit_price * od.quantity) * (1 - od.discount)) as "Total Sales"
    FROM orders o
    JOIN order_details od ON o.order_id = od.order_id
    JOIN employees e ON o.employee_id = e.employee_id
    GROUP BY e.employee_id
)
SELECT employee_id, employee_name, "Total Sales",
       RANK() OVER(ORDER BY "Total Sales" DESC) as "Sales Rank"
FROM EmployeeSales

   employee_id     employee_name    Total Sales  Sales Rank
0            4  Margaret Peacock  232890.845982           1
1            3   Janet Leverling  202812.842388           2
2            1     Nancy Davolio  192107.604657           3
3            2     Andrew Fuller  166537.755287           4
4            8    Laura Callahan  126862.277478           5
5            7       Robert King  124568.234851           6
6            9    Anne Dodsworth   77308.066238           7
7            6    Michael Suyama   73913.129378           8
8            5   Steven Buchanan   68792.282394           9

## Analysis
The total sales between top and bottom perform is factor of 3. But let's check to see if Steven is a new hire. Need to compare by tenure.
Margaret was hired 5 months before Steven in 93. Steven is listed as the Sales Manager, so he might not be directly responsible for many sales, instead coordinating the staff below him. Michael Suyama was also hired on the same date as Steven, and both their performances are low. The place of residence indicates they are both in the UK. Perhaps indicating that the UK market is substantially smaller than the US market.

## Follow on ideas
- Rank employees by region
- Generate a rolling average of sales revenue per month

In [19]:
%%sql
WITH EmployeeSales AS (
    SELECT 
        e.employee_id, 
        e.first_name || ' ' || e.last_name AS employee_name, 
        e.country,
        SUM((od.unit_price * od.quantity) * (1 - od.discount)) AS total_sales
    FROM 
        orders o
    JOIN 
        order_details od ON o.order_id = od.order_id
    JOIN 
        employees e ON o.employee_id = e.employee_id
    GROUP BY 
        e.employee_id, e.first_name, e.last_name, e.country
)
SELECT 
    country, 
    employee_id, 
    employee_name, 
    total_sales,
    RANK() OVER (PARTITION BY country ORDER BY total_sales DESC) AS sales_rank
FROM 
    EmployeeSales;

  country  employee_id     employee_name    total_sales  sales_rank
0      UK            7       Robert King  124568.234851           1
1      UK            9    Anne Dodsworth   77308.066238           2
2      UK            6    Michael Suyama   73913.129378           3
3      UK            5   Steven Buchanan   68792.282394           4
4     USA            4  Margaret Peacock  232890.845982           1
5     USA            3   Janet Leverling  202812.842388           2
6     USA            1     Nancy Davolio  192107.604657           3
7     USA            2     Andrew Fuller  166537.755287           4
8     USA            8    Laura Callahan  126862.277478           5

## Running total of monthly sales

We want to present a running total of the monthly sales to see if there's any busy periods, or quiet periods that might correspond with cultural events. For example, Thanksgiving and Christmas in the US, and Christmas in the UK.

In [3]:
%%sql
WITH MonthlySales AS (
    SELECT 
        date_trunc('month', o.order_date)::DATE AS month,
        SUM(od.unit_price * od.quantity * (1 - od.discount)) AS total_sales
    FROM 
        orders o
    JOIN 
        order_details od ON o.order_id = od.order_id
    GROUP BY 
        month
)
SELECT 
    month,
    SUM(total_sales) OVER (ORDER BY month) AS running_total
FROM 
    MonthlySales
ORDER BY 
    month;

         Month  Running Total
0   1996-07-01   2.786190e+04
1   1996-08-01   5.334717e+04
2   1996-09-01   7.972857e+04
3   1996-10-01   1.172443e+05
4   1996-11-01   1.628443e+05
5   1996-12-01   2.080840e+05
6   1997-01-01   2.693420e+05
7   1997-02-01   3.078257e+05
8   1997-03-01   3.463729e+05
9   1997-04-01   3.994058e+05
10  1997-05-01   4.531871e+05
11  1997-06-01   4.895499e+05
12  1997-07-01   5.405708e+05
13  1997-08-01   5.878585e+05
14  1997-09-01   6.434877e+05
15  1997-10-01   7.102369e+05
16  1997-11-01   7.537707e+05
17  1997-12-01   8.251692e+05
18  1998-01-01   9.193913e+05
19  1998-02-01   1.018807e+06
20  1998-03-01   1.123661e+06
21  1998-04-01   1.247459e+06
22  1998-05-01   1.265793e+06

## Analysis
The running total looks impressive, but there's definitely some months that are better than previous months. Obvious example is 1998-04-01 to 1998-05-01. While the data for May 98 is incomplete, it would be good to see the difference in montly performance

In [18]:
%%sql
WITH MonthlySales AS ( 
    SELECT 
        EXTRACT(MONTH FROM o.order_date) AS month, 
        EXTRACT(YEAR FROM o.order_date) AS year, 
        SUM(od.unit_price * od.quantity * (1 - od.discount)) AS total_sales
    FROM 
        orders o
    JOIN 
        order_details od ON o.order_id = od.order_id
    GROUP BY 
        month, year
),
LaggingSales AS (
    SELECT 
        month, 
        year, 
        total_sales,
        LAG(total_sales) OVER (ORDER BY year, month) AS prev_month_sales
    FROM 
        MonthlySales
)
SELECT 
    year, 
    month,
    ((total_sales - prev_month_sales) / prev_month_sales) * 100 AS growth_rate
FROM 
    LaggingSales;

    year  month  growth_rate
0   1996      7          NaN
1   1996      8    -8.530001
2   1996      9     3.516246
3   1996     10    42.205208
4   1996     11    21.549151
5   1996     12    -0.790382
6   1997      1    35.407981
7   1997      2   -37.177853
8   1997      3     0.165226
9   1997      4    37.579188
10  1997      5     1.411080
11  1997      6   -32.387634
12  1997      7    40.310576
13  1997      8    -7.316984
14  1997      9    17.640059
15  1997     10    19.989457
16  1997     11   -34.780054
17  1997     12    64.006850
18  1998      1    31.966644
19  1998      2     5.511633
20  1998      3     5.470856
21  1998      4    18.067503
22  1998      5   -85.190771

## Analysis
Looking at the month to month growth rate, we can see some spikes in sales around the October to December period. Correlating with Christmas and holidays.

## New objective
Customer analysis. We want to determine which customers are high value. We'll start by classifying orders into Above average or below average value.

In [9]:
%%sql
WITH OrderValues AS (
    SELECT
        o.customer_id,
        o.order_id,
        SUM(od.unit_price * od.quantity * (1-od.discount)) as "Order Value"
    FROM orders o
    JOIN order_details od ON o.order_id = od.order_id
    GROUP BY o.customer_id, o.order_id
)
SELECT customer_id,
       order_id,
       "Order Value",
       CASE
        WHEN "Order Value" > AVG("Order Value") OVER () THEN 'Above Average'
        ELSE 'Below Average'
       END AS "Value Category"
FROM OrderValues;

    customer_id  order_id  Order Value Value Category
0         SUPRD     11038   732.599998  Below Average
1         CACTU     10782    12.500000  Below Average
2         FAMIA     10725   287.799995  Below Average
3         GOURL     10423  1020.000000  Below Average
4         TORTU     10518  4150.050007  Above Average
..          ...       ...          ...            ...
825       AROUT     10707  1640.999997  Above Average
826       BLONP     10826   730.000000  Below Average
827       LAMAI     10371    72.959999  Below Average
828       MORGK     10575  2147.399986  Above Average
829       WELLI     10809   140.000000  Below Average

[830 rows x 4 columns]

### Continuation
Let's work out which are the most valuable customers. If we know how many orders per customer are above average we can generate a list of customers worth spending more time on

In [17]:
%%sql
WITH OrderValues AS (
    SELECT
        o.customer_id,
        o.order_id,
        SUM(od.unit_price * od.quantity * (1 - od.discount)) AS order_value
    FROM 
        orders o
    JOIN 
        order_details od ON o.order_id = od.order_id
    GROUP BY 
        o.customer_id, o.order_id
),
OrderClassification AS (
    SELECT 
        customer_id,
        order_id,
        order_value,
        CASE
            WHEN order_value > AVG(order_value) OVER () THEN 'Above Average'
            ELSE 'Below Average'
        END AS value_category
    FROM 
        OrderValues
)
SELECT 
    oc.customer_id, 
    c.company_name, 
    c.country,
    COUNT(CASE WHEN value_category = 'Above Average' THEN 1 END) AS above_average_count,
    COUNT(CASE WHEN value_category = 'Below Average' THEN 1 END) AS below_average_count,
    RANK() OVER (ORDER BY COUNT(CASE WHEN value_category = 'Above Average' THEN 1 END) DESC) AS customer_rank
FROM 
    OrderClassification oc
JOIN 
    customers c ON oc.customer_id = c.customer_id
GROUP BY 
    oc.customer_id, c.company_name, c.country
ORDER BY 
    customer_rank;

,customer_id,company_name,country,above_average_count,below_average_count,customer_rank
0,ERNSH,Ernst Handel,Austria,26,4,1
1,SAVEA,Save-a-lot Markets,USA,26,5,1
2,QUICK,QUICK-Stop,Germany,22,6,3
3,HUNGO,Hungry Owl All-Night Grocers,Ireland,11,8,4
4,RATTC,Rattlesnake Canyon Grocery,USA,10,8,5
...,...,...,...,...,...,...
84,LAUGB,Laughing Bacchus Wine Cellars,Canada,0,3,65
85,LACOR,La corne d'abondance,France,0,4,65
86,DUMON,Du monde entier,France,0,4,65
87,CACTU,Cactus Comidas para llevar,Argentina,0,6,65
88,WILMK,Wilman Kala,Finland,0,7,65

## Analysis
The top 3 customers are  
- Ernst Handel | Austria
- Save-a-lot Markets | USA
- QUICK-Stop | Germany

Indicating that the EU market is growing. Only 3 of the top 20 customers are based in the USA

## Product performance
We need to know of the different products being sold, which ones are the top performers. The categories table lists the 8 different product categories

In [6]:
%%sql
SELECT *
FROM categories

,category_id,category_name,description,picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",NaN
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",NaN
2,3,Confections,"Desserts, candies, and sweet breads",NaN
3,4,Dairy Products,Cheeses,NaN
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal",NaN
5,6,Meat/Poultry,Prepared meats,NaN
6,7,Produce,Dried fruit and bean curd,NaN
7,8,Seafood,Seaweed and fish,NaN

In [16]:
%%sql
WITH CategorySales AS (
    SELECT 
        c.category_id, 
        c.category_name,
        SUM(p.unit_price * od.quantity * (1 - od.discount)) AS total_sales
    FROM 
        categories c
    JOIN 
        products p ON c.category_id = p.category_id
    JOIN 
        order_details od ON p.product_id = od.product_id
    GROUP BY 
        c.category_id 
)
SELECT 
    category_id, 
    category_name,
    total_sales / SUM(total_sales) OVER () * 100 AS sales_percentage
FROM 
    CategorySales
ORDER BY 
    sales_percentage DESC;

   category_id   category_name  sales_percentage
0            1       Beverages         21.331025
1            4  Dairy Products         18.556755
2            3     Confections         13.289737
3            6    Meat/Poultry         12.902484
4            8         Seafood         10.195732
5            2      Condiments          8.400471
6            7         Produce          7.813322
7            5  Grains/Cereals          7.510473

## Analysis
Beverages, Dairy and Confections represents over half of the sales. The bottom 3 categories combined are only just more than Beverages

In [20]:
%%sql
WITH ProductSales AS (
    SELECT 
        p.product_id, 
        p.product_name, 
        c.category_id, 
        c.category_name,
        SUM(od.unit_price * od.quantity * (1 - od.discount)) AS total_sales
    FROM 
        products p
    JOIN 
        order_details od ON p.product_id = od.product_id
    JOIN 
        categories c ON p.category_id = c.category_id
    GROUP BY 
        p.product_id, p.product_name, c.category_id, c.category_name
),
RankedProducts AS (
    SELECT 
        product_id, 
        product_name, 
        category_id, 
        category_name, 
        total_sales,
        ROW_NUMBER() OVER (PARTITION BY category_id ORDER BY total_sales DESC) AS product_rank
    FROM 
        ProductSales
)
SELECT 
    category_name, 
    product_name, 
    total_sales
FROM 
    RankedProducts
WHERE 
    product_rank <= 3
ORDER BY 
    category_name, product_rank;

     category_name                      product_name    total_sales
0        Beverages                     Côte de Blaye  141396.735627
1        Beverages                       Ipoh Coffee   23526.699843
2        Beverages                             Chang   16355.959905
3       Condiments                      Vegie-spread   16701.095047
4       Condiments                    Sirop d'érable   14352.599874
5       Condiments  Louisiana Fiery Hot Pepper Sauce   13869.889446
6      Confections                    Tarte au sucre   47234.969979
7      Confections            Sir Rodney's Marmalade   22563.360295
8      Confections               Gumbär Gummibärchen   19849.144171
9   Dairy Products              Raclette Courdavault   71155.699909
10  Dairy Products                 Camembert Pierrot   46825.480295
11  Dairy Products            Mozzarella di Giovanni   24900.129392
12  Grains/Cereals            Gnocchi di nonna Alice   42593.059822
13  Grains/Cereals         Wimmers gute Semmelknödel   21957.967576
14  Grains/Cereals     Singaporean Hokkien Fried Mee    8574.999965
15    Meat/Poultry           Thüringer Rostbratwurst   80368.672439
16    Meat/Poultry                      Alice Mutton   32698.380216
17    Meat/Poultry                     Perth Pasties   20574.169932
18         Produce             Manjimup Dried Apples   41819.650246
19         Produce                 Rössle Sauerkraut   25696.639789
20         Produce   Uncle Bob's Organic Dried Pears   22044.299988
21         Seafood                  Carnarvon Tigers   29171.874963
22         Seafood                             Ikura   20867.339869
23         Seafood                  Boston Crab Meat   17910.629646

## Analysis
The majority of value from the beverages category is just the Cote de Blaye. This warrants modifying the query to determine how much each product is contributing to it's category. It's important to know if the data is being skewed by one large order for one product or not

In [22]:
%%sql
WITH ProductSales AS (
    SELECT 
        p.product_id, 
        p.product_name, 
        c.category_id, 
        c.category_name,
        SUM(od.unit_price * od.quantity * (1 - od.discount)) AS total_sales
    FROM 
        products p
    JOIN 
        order_details od ON p.product_id = od.product_id
    JOIN 
        categories c ON p.category_id = c.category_id
    GROUP BY 
        p.product_id, p.product_name, c.category_id, c.category_name
),
CategorySales AS (
    SELECT 
        category_id,
        SUM(total_sales) AS category_total_sales
    FROM 
        ProductSales
    GROUP BY 
        category_id
),
RankedProducts AS (
    SELECT 
        ps.product_id, 
        ps.product_name, 
        ps.category_id, 
        ps.category_name, 
        ps.total_sales,
        cs.category_total_sales,
        ROW_NUMBER() OVER (PARTITION BY ps.category_id ORDER BY ps.total_sales DESC) AS product_rank,
        (ps.total_sales / cs.category_total_sales) * 100 AS sales_percentage
    FROM 
        ProductSales ps
    JOIN 
        CategorySales cs ON ps.category_id = cs.category_id
)
SELECT 
    category_name, 
    product_name, 
    total_sales,
    sales_percentage,
    product_rank
FROM 
    RankedProducts
WHERE 
    product_rank <= 6
ORDER BY 
    category_name, product_rank;

,category_name,product_name,total_sales,sales_percentage,product_rank
0,Beverages,Côte de Blaye,141396.735627,52.785940,1
1,Beverages,Ipoh Coffee,23526.699843,8.782939,2
2,Beverages,Chang,16355.959905,6.105973,3
3,Beverages,Lakkalikööri,15760.439892,5.883655,4
4,Beverages,Steeleye Stout,13643.999850,5.093550,5
5,Beverages,Chai,12788.099920,4.774027,6
6,Condiments,Vegie-spread,16701.095047,15.748755,1
7,Condiments,Sirop d'érable,14352.599874,13.534177,2
8,Condiments,Louisiana Fiery Hot Pepper Sauce,13869.889446,13.078992,3
9,Condiments,Northwoods Cranberry Sauce,12771.999989,12.043707,4
10,Condiments,Gula Malacca,9915.945214,9.350512,5
11,Condiments,Original Frankfurter grüne Soße,9171.629910,8.648639,6
12,Confections,Tarte au sucre,47234.969979,28.224040,1
13,Confections,Sir Rodney's Marmalade,22563.360295,13.482155,2
14,Confections,Gumbär Gummibärchen,19849.144171,11.860345,3
15,Confections,Pavlova,17215.775863,10.286843,4
16,Confections,Schoggi Schokolade,15099.875288,9.022542,5
17,Confections,Maxilaku,9244.599993,5.523873,6
18,Dairy Products,Raclette Courdavault,71155.699909,30.342639,1
19,Dairy Products,Camembert Pierrot,46825.480295,19.967602,2
20,Dairy Products,Mozzarella di Giovanni,24900.129392,10.618062,3
21,Dairy Products,Gudbrandsdalsost,21942.359829,9.356792,4
22,Dairy Products,Flotemysost,19551.025301,8.337065,5
23,Dairy Products,Gorgonzola Telino,14920.874979,6.362649,6
24,Grains/Cereals,Gnocchi di nonna Alice,42593.059822,44.486128,1
25,Grains/Cereals,Wimmers gute Semmelknödel,21957.967576,22.933900,2
26,Grains/Cereals,Singaporean Hokkien Fried Mee,8574.999965,8.956120,3
27,Grains/Cereals,Ravioli Angelo,7661.550061,8.002071,4
28,Grains/Cereals,Gustaf's Knäckebröd,7122.359986,7.438917,5
29,Grains/Cereals,Tunnbröd,4601.699954,4.806225,6
30,Meat/Poultry,Thüringer Rostbratwurst,80368.672439,49.299171,1
31,Meat/Poultry,Alice Mutton,32698.380216,20.057604,2
32,Meat/Poultry,Perth Pasties,20574.169932,12.620459,3
33,Meat/Poultry,Pâté chinois,17426.400270,10.689577,4
34,Meat/Poultry,Mishi Kobe Niku,7226.499961,4.432827,5
35,Meat/Poultry,Tourtière,4728.237451,2.900361,6
36,Produce,Manjimup Dried Apples,41819.650246,41.826100,1
37,Produce,Rössle Sauerkraut,25696.639789,25.700603,2
38,Produce,Uncle Bob's Organic Dried Pears,22044.299988,22.047700,3
39,Produce,Tofu,7991.490052,7.992723,4
40,Produce,Longlife Tofu,2432.499999,2.432875,5
41,Seafood,Carnarvon Tigers,29171.874963,22.224203,1
42,Seafood,Ikura,20867.339869,15.897504,2
43,Seafood,Boston Crab Meat,17910.629646,13.644974,3
44,Seafood,Inlagd Sill,13458.459957,10.253148,4
45,Seafood,Nord-Ost Matjeshering,13424.197396,10.227045,5
46,Seafood,Jack's New England Clam Chowder,8680.344672,6.613005,6

## Continuation

By modifying the query to calculate the sales percentage per category, we can see that half of all the beverage sales
 comes from one product. For Meat and Poultry, the top 3 products represent 82% of sales, for produce the top 3 represent close to 90%

In [23]:
%%sql
WITH ProductSales AS (
    SELECT 
        p.product_id, 
        p.product_name, 
        c.category_id, 
        c.category_name,
        SUM(od.unit_price * od.quantity * (1 - od.discount)) AS total_sales
    FROM 
        products p
    JOIN 
        order_details od ON p.product_id = od.product_id
    JOIN 
        categories c ON p.category_id = c.category_id
    GROUP BY 
        p.product_id, p.product_name, c.category_id, c.category_name
),
CategorySales AS (
    SELECT 
        category_id,
        SUM(total_sales) AS category_total_sales
    FROM 
        ProductSales
    GROUP BY 
        category_id
),
RankedProducts AS (
    SELECT 
        ps.product_id, 
        ps.product_name, 
        ps.category_id, 
        ps.category_name, 
        ps.total_sales,
        cs.category_total_sales,
        ROW_NUMBER() OVER (PARTITION BY ps.category_id ORDER BY ps.total_sales DESC) AS product_rank,
        (ps.total_sales / cs.category_total_sales) * 100 AS sales_percentage,
        SUM(ps.total_sales) OVER (PARTITION BY ps.category_id ORDER BY ps.total_sales DESC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW) AS cumulative_sales
    FROM 
        ProductSales ps
    JOIN 
        CategorySales cs ON ps.category_id = cs.category_id
)
SELECT 
    category_name, 
    product_name, 
    total_sales,
    sales_percentage,
    (cumulative_sales / category_total_sales) * 100 AS cumulative_percentage,
    product_rank
FROM 
    RankedProducts
WHERE 
    product_rank <= 3
ORDER BY 
    category_name, product_rank;

,category_name,product_name,total_sales,sales_percentage,cumulative_percentage,product_rank
0,Beverages,Côte de Blaye,141396.735627,52.785940,52.785940,1
1,Beverages,Ipoh Coffee,23526.699843,8.782939,61.568879,2
2,Beverages,Chang,16355.959905,6.105973,67.674852,3
3,Condiments,Vegie-spread,16701.095047,15.748755,15.748755,1
4,Condiments,Sirop d'érable,14352.599874,13.534177,29.282931,2
5,Condiments,Louisiana Fiery Hot Pepper Sauce,13869.889446,13.078992,42.361923,3
6,Confections,Tarte au sucre,47234.969979,28.224040,28.224040,1
7,Confections,Sir Rodney's Marmalade,22563.360295,13.482155,41.706195,2
8,Confections,Gumbär Gummibärchen,19849.144171,11.860345,53.566540,3
9,Dairy Products,Raclette Courdavault,71155.699909,30.342639,30.342639,1
10,Dairy Products,Camembert Pierrot,46825.480295,19.967602,50.310241,2
11,Dairy Products,Mozzarella di Giovanni,24900.129392,10.618062,60.928303,3
12,Grains/Cereals,Gnocchi di nonna Alice,42593.059822,44.486128,44.486128,1
13,Grains/Cereals,Wimmers gute Semmelknödel,21957.967576,22.933900,67.420028,2
14,Grains/Cereals,Singaporean Hokkien Fried Mee,8574.999965,8.956120,76.376148,3
15,Meat/Poultry,Thüringer Rostbratwurst,80368.672439,49.299171,49.299171,1
16,Meat/Poultry,Alice Mutton,32698.380216,20.057604,69.356776,2
17,Meat/Poultry,Perth Pasties,20574.169932,12.620459,81.977235,3
18,Produce,Manjimup Dried Apples,41819.650246,41.826100,41.826100,1
19,Produce,Rössle Sauerkraut,25696.639789,25.700603,67.526703,2
20,Produce,Uncle Bob's Organic Dried Pears,22044.299988,22.047700,89.574402,3
21,Seafood,Carnarvon Tigers,29171.874963,22.224203,22.224203,1
22,Seafood,Ikura,20867.339869,15.897504,38.121707,2
23,Seafood,Boston Crab Meat,17910.629646,13.644974,51.766681,3